Repository: WizardCell/Yalla-Negev
Catalog: lib/l10n/intl_*.arb
Languages: he

# welcome
source: Welcome to YallaNegev!
he: ברוכים הבאים ל-YallaNegev!

source: Yalla Negev
he: יאללה נגב

# welcomeDescription
source: A platform that allows you to share your opinion and influence the life of your community
he: פלטפורמה המאפשרת לך להביע את דעתך ולהשפיע על חיי הקהילה שלך

# getStarted
source: How it works
he: איך זה עובד

# getStartedDescription
source: Answer surveys, earn points, and get rewards
he: ענה על סקרים, צבור נקודות, וקבל תגמולים

source: Allow Notifications
he: אפשר התראות

source: Grant Permission
he: אפשר הרשאה

source: Permission Granted
he: ההרשאה אושרה

# notificationPermissionDescription
source: We will send you only important notifications to help you stay updated.
he: נשלח לך רק התראות חשובות שיעזרו לך להישאר מעודכן.

source: Allow Geolocation
he: אפשר גיאולוקציה

# geolocationPermissionDescription
source: Some of our surveys require your location to provide you with the best experience.
he: חלק מהסקרים שלנו דורשים את המיקום שלך כדי לספק לך את החוויה הטובה ביותר.

source: Next
he: הבא

source: Finish
he: סיום

source: You are all set!
he: אתה מוכן!

source: Do not show again
he: אל תציג שוב

source: Notify Users
he: הודע למשתמשים

# notificationTitle
source: Title
he: כותרת

# notificationDescription
source: Description
he: תיאור

source: Image URL (optional)
he: כתובת תמונה (אופציונלי)

# enterTitle
source: Please enter a title
he: נא להכניס כותרת

# enterDescription
source: Please enter a description
he: נא להכניס תיאור

source: Send Notification
he: שלח הודעה

# notificationSentSuccess
source: Notification sent successfully!
he: ההודעה נשלחה בהצלחה!

# notificationSentFailed
source: Failed to send notification
he: נכשל לשלוח הודעה

source: Admin Configuration
he: תצורת ניהול

source: Support Email
he: אימייל תמיכה

# pleaseEnterSupportEmail
source: Please enter a support email
he: נא להכניס אימייל תמיכה

source: WhatsApp Link
he: קישור ל-WhatsApp

# pleaseEnterWhatsappLink
source: Please enter a WhatsApp link
he: נא להכניס קישור ל-WhatsApp

source: Save Configuration
he: שמור תצורה

source: Configuration updated successfully!
he: התצורה עודכנה בהצלחה!

source: Failed to update configuration
he: נכשל לעדכן תצורה

source: Sign Up
he: הירשם

source: Sign In
he: התחבר

# signInGoogle
source: Sign in with Google
he: התחבר עם Google

source: or
he: או

source: Apply
he: החל

source: Edit
he: ערוך

source: Save
he: שמור

source: Delete
he: מחק

source: Help
he: עזרה

source: OK
he: אישור

# confirmDelete
source: Delete survey?
he: למחוק סקר?

source: Delete Survey
he: מחק סקר

# deleteConfirmationText
source: Are you sure you want to delete this survey?
he: האם אתה בטוח שברצונך למחוק את הסקר הזה?

source: Swipe to confirm
he: החלק כדי לאשר

# voiceShapes
source: Your voice shapes the future of the Negev!
he: הקול שלך מעצב את עתיד הנגב!

source: Surveys
he: סקרים

source: Questions
he: שאלות

source: No questionnaires found
he: לא נמצאו שאלונים

source: Reset filters
he: אפס מסננים

# responsesSaved
source: Responses saved successfully!
he: התשובות נשמרו בהצלחה!

# showingSurveys
source: Showing {filteredSurveys} of {surveys}
he: מציג {filteredSurveys} מתוך {surveys}

source: Users
he: משתמשים

source: No users found
he: לא נמצאו משתמשים

source: Leaderboard
he: לוח תוצאות

source: Manage Users
he: נהל משתמשים

# userRoleNone
source: None
he: ללא

# userRoleUser
source: Regular User
he: משתמש רגיל

# userRoleClubMember
source: Club Member
he: חבר מועדון

# userRoleAdmin
source: Admin
he: מנהל

source: Yes/No
he: כן/לא

source: Multiple Choice
he: בחירה מרובה

source: Text
he: טקסט

source: Score
he: ציון

source: Numerical
he: מספרי

source: Date & Time
he: תאריך ושעה

source: Date
he: תאריך

source: Time
he: שעה

source: Unknown
he: לא ידוע

source: Question Text
he: טקסט שאלה

source: Question
he: שאלה

source: Options
he: אפשרויות

source: Remove Option
he: הסר אפשרות

source: Required
he: חובה

source: Profile
he: פרופיל

source: Confirm
he: אשר

source: Cancel
he: ביטול

source: Error
he: שגיאה

# saveError
source: Error saving
he: שגיאה בשמירה

source: Add User
he: הוסף משתמש

source: Edit User
he: ערוך משתמש

source: Filter
he: סנן

source: Search
he: חיפוש

source: points
he: נקודות

source: Manage
he: נהל

source: Thank you!
he: תודה!

# youGotPoints
source: You received {points} points
he: קיבלת {points} נקודות

source: Responses
he: תשובות

source: Preview
he: תצוגה מקדימה

source: in the ranking
he: בדירוג

source: this user
he: המשתמש הזה

# upgradeUser
source: Upgrade {user} to «Club Member»
he: שדרג את {user} ל«חבר מועדון»

# downgradeUser
source: Downgrade {user} to «Regular User»
he: הורד את {user} ל«משתמש רגיל»

# promoteToAdmin
source: Promote {user} to Admin
he: קדם את {user} למנהל

# promoteToAdminConfirmation
source: Are you really sure that you want to promote {user} to Admin?
he: האם אתה באמת בטוח שברצונך לקדם את {user} למנהל?

# revokeAdmin
source: Revoke Admin from {user}
he: שלול סטטוס מנהל מ-{user}

# manualAwardBadge
source: Manually Award Badge
he: הענקת תג ידנית

# manualAwardBadgeTitle
source: Select a Badge to Award
he: בחר תג להענקה

# selectBadge
source: Select a badge
he: בחר תג

source: Award Badge
he: הענק תג

# upgradeUserNotice
source: When the status is upgraded to "Club Member", the user will be able to fill out and send reports
he: כאשר הסטטוס משודרג ל"חבר מועדון", המשתמש יוכל למלא ולשלוח דוחות

# downgradeUserNotice
source: With downgrading to the regular user, the user will no longer be able to fill out and send reports
he: בהורדה למשתמש רגיל, המשתמש לא יוכל יותר למלא ולשלוח דוחות

# promoteToAdminNotice
source: When the status of an "Admin" is provided, the user will be able to manage users and surveys
he: כאשר ניתן הסטטוס "מנהל", המשתמש יוכל לנהל משתמשים וסקרים

# revokeAdminNotice
source: When the status of an "Admin" is revoked, the user will no longer be able to manage users and surveys
he: כאשר הסטטוס "מנהל" נשלל, המשתמש לא יוכל יותר לנהל משתמשים וסקרים

source: Pending Approval
he: בהמתנה לאישור

# pendingApprovalS1
source: You are almost ready for takeoff, and we are happy to see you!
he: אתה כמעט מוכן להמראה, ואנחנו שמחים לראות אותך!

# pendingApprovalS2
source: We received your application to become a YallaNegev Club member.
he: קיבלנו את הבקשה שלך להפוך לחבר מועדון יאללה נגב.

# pendingApprovalS3
source: We will notify you when your application is approved.
he: נודיע לך כאשר הבקשה שלך תאושר.

# pendingApprovalS4
source: Once your application is approved, you will be able to send reports and collect points.
he: לאחר שהבקשה תאושר, תוכל לשלוח דוחות ולצבור נקודות.

source: My Reports
he: הדוחות שלי

source: My points
he: הנקודות שלי

source: Rewards
he: תגמולים

# youHavePoints
source: You have {points} points
he: יש לך {points} נקודות

# badgesCollected
source: {badgesCollected} out of {totalBadges} badges collected
he: {badgesCollected} מתוך {totalBadges} תגי נאספו

# leaderboardPosition
source: Leaderboard position: {position}
he: מיקום בלוח התוצאות: {position}

# yourPosition
source: Your position is
he: המיקום שלך הוא

# positionInRanking
source: {rank} place in the ranking
he: מקום {rank} בדירוג

source: You
he: אתה

source: Points Details
he: פרטי הנקודות

# totalPoints
source: Total Points: {totalPoints}
he: סה"כ נקודות: {totalPoints}

source: Points History
he: היסטוריית נקודות

source: Loading points history...
he: טוען היסטוריית נקודות...

source: Failed to load points history.
he: נכשל לטעון את היסטוריית הנקודות.

source: No points history available.
he: אין היסטוריית נקודות זמינה.

# earnedPoints
source: Points Earned
he: נקודות שנצברו

# spentPoints
source: Points Spent
he: נקודות שנוצלו

source: Redeem Points
he: פדה נקודות

# redeemNotSupported
source: Redeeming points is currently not supported.
he: פדיון נקודות אינו נתמך כרגע.

source: Badges
he: תגים

source: Failed to load badges.
he: נכשל לטעון תגי.

source: No badges available.
he: אין תגי זמינים.

source: Earned Badges
he: תגים שנאספו

source: Unearned Badges
he: תגים שלא נאספו

source: Error loading responses:
he: שגיאה בטעינת התשובות:

source: Number of responses
he: מספר התשובות

source: No data loaded
he: לא נטען מידע

source: Admin Dashboard
he: לוח ניהול

source: Configuration
he: תצורה

# badgesEditingTitle
source: Badges Editing
he: עריכת תגי

# badgesEditingMessage
source: Editing badges from this interface is currently not supported.
he: עריכת תגי מממשק זה אינה נתמכת כרגע.

source: No categories available
he: אין קטגוריות זמינות

source: Description
he: תיאור

source: Start Date
he: תאריך התחלה

source: End Date
he: תאריך סיום

source: Max reports per user total
he: מקסימום דוחות למשתמש סך הכל

source: Max reports per user per day
he: מקסימום דוחות למשתמש ליום

# maxReportsPerUserTotalShort
source: Max Total
he: מקסימום סה"כ

# maxReportsPerUserPerDayShort
source: Max / Day
he: מקסימום / יום

# editorValidationError
source: Please fill in the fields correctly
he: נא למלא את השדות כהלכה

source: Min Value
he: ערך מינימום

source: Max Value
he: ערך מקסימום

source: Option
he: אפשרות

source: Add Option
he: הוסף אפשרות

source: Remove Question
he: הסר שאלה

source: to
he: אל

source: Icon
he: אייקון

source: Pick Icon
he: בחר אייקון

source: Less
he: פחות

source: More
he: יותר

source: Category
he: קטגוריה

source: Email sent
he: האימייל נשלח

source: Check your inbox!
he: בדוק את תיבת הדואר שלך!

# problemSendingEmail
source: There was a problem sending the email
he: הייתה בעיה בשליחת האימייל

source: Restore password
he: שחזר סיסמה

# dontHaveAccount
source: Don't have an account?
he: אין לך חשבון?

source: Reset Password
he: אפס סיסמה

source: Email
he: אימייל

source: Password
he: סיסמה

# errorLoggingIn
source: There was an error logging into the app
he: הייתה שגיאה בהתחברות לאפליקציה

source: Forgot password?
he: שכחת סיסמה?

source: Name
he: שם

source: Display Name
he: שם תצוגה

source: Confirm Password
he: אשר סיסמה

# signInError
source: An error occurred while trying to sign you in, please try again later.
he: אירעה שגיאה בניסיון להתחבר, נסה שוב מאוחר יותר.

# alreadyHaveAccount
source: Already have an account?
he: כבר יש לך חשבון?

# signInGoogleError
source: An error occurred while trying to sign you in, please try again later.
he: אירעה שגיאה בניסיון להתחבר, נסה שוב מאוחר יותר.

source: Edit Survey
he: ערוך סקר

source: Add Survey
he: הוסף סקר

source: Add Question
he: הוסף שאלה

source: Pick Category
he: בחר קטגוריה

source: Failed to load leaderboard
he: נכשל לטעון את לוח התוצאות

source: Upload Image
he: העלה תמונה

source: Change
he: שנה

source: Upload failed
he: ההעלאה נכשלה

source: Pick Survey Image
he: בחר תמונת סקר

# noImageSelected
source: No image was selected
he: לא נבחרה תמונה

# grantPermissionPhoto
source: You need to grant permission if you want to select a photo
he: עליך לאשר הרשאה אם ברצונך לבחור תמונה

source: Save Profile
he: שמור פרופיל

source: Edit Profile
he: ערוך פרופיל

source: About
he: אודות

source: Settings
he: הגדרות

source: Sign Out
he: התנתק

source: Join WhatsApp group
he: הצטרף לקבוצת WhatsApp

source: Contact the team
he: צור קשר עם הצוות

# cannotLaunchWhatsAppTitle
source: WhatsApp Unavailable
he: WhatsApp אינו זמין

# useWhatsAppLink
source: You can use this WhatsApp link to contact us:
he: תוכל להשתמש בקישור הזה ל-WhatsApp כדי ליצור איתנו קשר:

# cannotLaunchEmailTitle
source: Email Client Unavailable
he: לקוח האימייל אינו זמין

# useEmailAddress
source: You can use this e-mail address to contact us:
he: תוכל להשתמש בכתובת האימייל הזו כדי ליצור איתנו קשר:

# negevCommunitySupport
source: The app is designed to support Negev community in its digital transformation
he: האפליקציה מיועדת לתמוך בקהילת הנגב במעבר הדיגיטלי שלה

# dataProcessedLegally
source: The data is processed in accordance with the law
he: הנתונים מעובדים בהתאם לחוק

source: Show welcome onboarding
he: הצג את ההדרכה המקבלת

# createdWithLove
source: This app is created in our country with ♥
he: האפליקציה הזו נוצרה בארצנו עם ♥

source: Filters not implemented
he: המסננים אינם מיושמים

source: Yes
he: כן

source: No
he: לא

source: Enter your answer here
he: הכנס את תשובתך כאן

source: Enter a number
he: הכנס מספר

# selectDateTime
source: Select a date and time
he: בחר תאריך ושעה

source: Language
he: שפה

source: English
he: אנגלית

source: Hebrew
he: עברית

source: Arabic
he: ערבית

source: Dark Theme
he: ערכת נושא כהה

source: Manage your account
he: נהל את החשבון שלך

source: Manage privacy and security settings
he: נהל הגדרות פרטיות ואבטחה

# enterAlphabetic
source: Please enter only alphabetic characters and spaces
he: נא להכניס רק תווים אלפביתיים ורווחים

# nameLength
source: Name must be at least 2 characters long
he: השם חייב להיות באורך של לפחות 2 תווים

# enterName
source: Please enter your name
he: נא להכניס שם

# enterAlphanumeric
source: Please enter only alphanumeric characters
he: נא להכניס רק תווים אלפאנומריים

# displayNameLength
source: Display name must be at least 2 characters long
he: שם התצוגה חייב להיות באורך של לפחות 2 תווים

# enterDisplayName
source: Please enter your display name
he: נא להכניס שם תצוגה

# enterEmail
source: Please enter an email address
he: נא להכניס כתובת אימייל

# emailAt
source: Email address must contain @
he: כתובת האימייל חייבת להכיל @

# emailDot
source: Email address must contain .
he: כתובת האימייל חייבת להכיל .

# emailSpace
source: Email address must not contain spaces
he: כתובת האימייל לא יכולה להכיל רווחים

# validEmail
source: Enter a valid email address, for example: user@example.com
he: נא להכניס כתובת אימייל תקינה, לדוגמה: user@example.com

# enterPassword
source: Please enter your password
he: נא להכניס סיסמה

# passwordLength
source: Password must be at least 6 characters
he: הסיסמה חייבת להיות באורך של לפחות 6 תווים

# displayNameExists
source: Display name already exists, please choose another one.
he: שם התצוגה כבר קיים, נא לבחור שם אחר.

source: Passwords do not match
he: הסיסמאות אינן תואמות

# uniqueNameInfo
source: This is a unique name that will be displayed to other users
he: זהו שם ייחודי שיוצג למשתמשים אחרים

# emailInUse
source: An error occurred: Email already in use.
he: אירעה שגיאה: האימייל כבר בשימוש.

# weakPassword
source: An error occurred: Weak password.
he: אירעה שגיאה: סיסמה חלשה.

# invalidEmail
source: An error occurred: Invalid email.
he: אירעה שגיאה: אימייל לא תקין.

# fillFieldsCorrectly
source: Please fill in the fields correctly
he: נא למלא את השדות כהלכה

source: Sorry!
he: סליחה!

source: Congratulations!
he: מזל טוב!

source: You have been demoted to
he: הורדת לדרגת

source: You have been promoted to
he: קודמת לדרגת

# submittedOn
source: Submitted on {date}
he: הוגש בתאריך {date}

source: Something went wrong
he: משהו השתבש

source: No reports submitted yet
he: לא הוגשו דוחות עדיין

# joinDate
source: Joined on {formattedJoinDate}
he: הצטרף ב-{formattedJoinDate}

source: Submit
he: שלח

source: Survey Response
he: תשובות לסקר

source: Coordinates
he: קואורדינטות

source: Points Credited
he: נקודות שהוקצו

source: Submitted
he: נשלח

source: Survey ID
he: מזהה סקר

source: User ID
he: מזהה משתמש

source: Delete Account
he: מחק חשבון

# enterEmailToDeleteAccount
source: Please enter your email to confirm account deletion:
he: אנא הזן את האימייל שלך כדי לאשר מחיקת חשבון:

# confirmDeleteAccount
source: I understand the consequences, and I want to delete my account
he: אני מבין את ההשלכות ורוצה למחוק את החשבון שלי
